In [5]:
import pandas as pd
import numpy as np

In [8]:
df = pd.read_csv("amazon_fire.csv", encoding = "latin")

In [9]:
df.head()

    ano      mes estado   numero  encontro
0  1998  Janeiro   Acre  0 Fires  1/1/1998
1  1999  Janeiro   Acre  0 Fires  1/1/1999
2  2000  Janeiro   Acre  0 Fires  1/1/2000
3  2001  Janeiro   Acre  0 Fires  1/1/2001
4  2002  Janeiro   Acre  0 Fires  1/1/2002

In [10]:
df.shape

(6454, 5)

In [11]:
df.dtypes

ano          int64
mes         object
estado      object
numero      object
encontro    object
dtype: object

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6454 entries, 0 to 6453
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   ano       6454 non-null   int64
 1   mes       6454 non-null   object
 2   estado    6454 non-null   object
 3   numero    6322 non-null   object
 4   encontro  6454 non-null   object
dtypes: int64(1), object(4)
memory usage: 252.2+ KB

In [13]:
df.describe()

               ano
count  6454.000000
mean   2007.461729
std       5.746654
min    1998.000000
25%    2002.000000
50%    2007.000000
75%    2012.000000
max    2017.000000

In [14]:
df.head()

    ano      mes estado   numero  encontro
0  1998  Janeiro   Acre  0 Fires  1/1/1998
1  1999  Janeiro   Acre  0 Fires  1/1/1999
2  2000  Janeiro   Acre  0 Fires  1/1/2000
3  2001  Janeiro   Acre  0 Fires  1/1/2001
4  2002  Janeiro   Acre  0 Fires  1/1/2002

In [15]:
df.tail()

       ano       mes     estado numero  encontro
6449  2012  Dezembro  Tocantins    128  1/1/2012
6450  2013  Dezembro  Tocantins     85  1/1/2013
6451  2014  Dezembro  Tocantins    223  1/1/2014
6452  2015  Dezembro  Tocantins    373  1/1/2015
6453  2016  Dezembro  Tocantins    119  1/1/2016

In [16]:
df["estado"].uniqueque()

array(['Acre', 'alagoas', 'Amapa', 'Amazonas', 'Bahia', 'Ceara',
       'Distrito Federal', 'Espirito Santo', 'Goias', 'Maranhao',
       'Mato Grosso', 'Minas Gerais', 'pará', 'Paraiba', 'Pernambuco',
       'Piau', 'Rio', 'rondonia', 'Roraima', 'Santa Catarina',
       'Sao Paulo', 'Sergipe', 'Tocantins'], dtype=object)

In [17]:
len(df["estado"].unique())

23

In [19]:
new_col = {"ano" : "year",
          "mes" : "month",
          "estado" : "state",
          "numero" : "number_of_fires",
          "encontro" : "date"}

df.rename(columns = new_col, inplace = True)

In [20]:
df.head()

   year    month state number_of_fires      date
0  1998  Janeiro  Acre         0 Fires  1/1/1998
1  1999  Janeiro  Acre         0 Fires  1/1/1999
2  2000  Janeiro  Acre         0 Fires  1/1/2000
3  2001  Janeiro  Acre         0 Fires  1/1/2001
4  2002  Janeiro  Acre         0 Fires  1/1/2002

In [21]:
df["year"].unique()

array([1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008,
       2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017], dtype=int64)

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6454 entries, 0 to 6453
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   year             6454 non-null   int64
 1   month            6454 non-null   object
 2   state            6454 non-null   object
 3   number_of_fires  6322 non-null   object
 4   date             6454 non-null   object
dtypes: int64(1), object(4)
memory usage: 252.2+ KB

## Re-arranging columns

In [23]:
new_order = [4, 1, 0, 2, 3]
df = df[df.columns[new_order]]

In [24]:
df.head()

       date    month  year state number_of_fires
0  1/1/1998  Janeiro  1998  Acre         0 Fires
1  1/1/1999  Janeiro  1999  Acre         0 Fires
2  1/1/2000  Janeiro  2000  Acre         0 Fires
3  1/1/2001  Janeiro  2001  Acre         0 Fires
4  1/1/2002  Janeiro  2002  Acre         0 Fires

In [27]:
df["number_of_fires"].str.isnumeric()

0       False
1       False
2       False
3       False
4       False
        ...
6449     True
6450     True
6451     True
6452     True
6453     True
Name: number_of_fires, Length: 6454, dtype: object

In [29]:
df["number_of_fires"].astype(str).str.isdigit()

0       False
1       False
2       False
3       False
4       False
        ...
6449     True
6450     True
6451     True
6452     True
6453     True
Name: number_of_fires, Length: 6454, dtype: bool

In [73]:
df[df.number_of_fires == "0 Fires"]

          date    month  year  state number_of_fires
0     1/1/1998  Janeiro  1998   Acre         0 Fires
1     1/1/1999  Janeiro  1999   Acre         0 Fires
2     1/1/2000  Janeiro  2000   Acre         0 Fires
3     1/1/2001  Janeiro  2001   Acre         0 Fires
4     1/1/2002  Janeiro  2002   Acre         0 Fires
...        ...      ...   ...    ...             ...
1995  1/1/2000     Maio  2000  Goias         0 Fires
2014  1/1/1999    Junho  1999  Goias         0 Fires
2017  1/1/2002    Junho  2002  Goias         0 Fires
2033  1/1/1998    Julho  1998  Goias         0 Fires
2053  1/1/1998   Agosto  1998  Goias         0 Fires

[169 rows x 5 columns]

In [76]:
#df.loc[df.a.str.contains("foo", na=False)]
fires = df.loc[df.number_of_fires.str.contains("Fires", na = False)]

In [77]:
fires

          date     month  year  state number_of_fires
0     1/1/1998   Janeiro  1998   Acre         0 Fires
1     1/1/1999   Janeiro  1999   Acre         0 Fires
2     1/1/2000   Janeiro  2000   Acre         0 Fires
3     1/1/2001   Janeiro  2001   Acre         0 Fires
4     1/1/2002   Janeiro  2002   Acre         0 Fires
...        ...       ...   ...    ...             ...
2146  1/1/2011  Dezembro  2011  Goias        24 Fires
2147  1/1/2012  Dezembro  2012  Goias        32 Fires
2149  1/1/2014  Dezembro  2014  Goias        45 Fires
2150  1/1/2015  Dezembro  2015  Goias        19 Fires
2151  1/1/2016  Dezembro  2016  Goias        20 Fires

[934 rows x 5 columns]

In [79]:
df["number_of_fires"].str.strip(" Fires")

0         0
1         0
2         0
3         0
4         0
       ...
6449    128
6450     85
6451    223
6452    373
6453    119
Name: number_of_fires, Length: 6454, dtype: object

In [80]:
df.head()

       date    month  year state number_of_fires
0  1/1/1998  Janeiro  1998  Acre         0 Fires
1  1/1/1999  Janeiro  1999  Acre         0 Fires
2  1/1/2000  Janeiro  2000  Acre         0 Fires
3  1/1/2001  Janeiro  2001  Acre         0 Fires
4  1/1/2002  Janeiro  2002  Acre         0 Fires

In [81]:
df["number_of_fires"] = df["number_of_fires"].str.strip(" Fires")

In [82]:
df.head()

       date    month  year state number_of_fires
0  1/1/1998  Janeiro  1998  Acre               0
1  1/1/1999  Janeiro  1999  Acre               0
2  1/1/2000  Janeiro  2000  Acre               0
3  1/1/2001  Janeiro  2001  Acre               0
4  1/1/2002  Janeiro  2002  Acre               0

In [83]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6454 entries, 0 to 6453
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   date             6454 non-null   object
 1   month            6454 non-null   object
 2   year             6454 non-null   int64
 3   state            6454 non-null   object
 4   number_of_fires  6322 non-null   object
dtypes: int64(1), object(4)
memory usage: 252.2+ KB

In [85]:
df["number_of_fires"] = df["number_of_fires"].str.replace("", "0").astype(float)

In [86]:
df.head()

       date    month  year state  number_of_fires
0  1/1/1998  Janeiro  1998  Acre              0.0
1  1/1/1999  Janeiro  1999  Acre              0.0
2  1/1/2000  Janeiro  2000  Acre              0.0
3  1/1/2001  Janeiro  2001  Acre              0.0
4  1/1/2002  Janeiro  2002  Acre              0.0

In [87]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6454 entries, 0 to 6453
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   date             6454 non-null   object
 1   month            6454 non-null   object
 2   year             6454 non-null   int64
 3   state            6454 non-null   object
 4   number_of_fires  6322 non-null   float64
dtypes: float64(1), int64(1), object(3)
memory usage: 252.2+ KB

In [88]:
df.isnull().sum()

date                 0
month                0
year                 0
state                0
number_of_fires    132
dtype: int64

In [89]:
df.dropna(inplace=True)

In [90]:
df.head()

       date    month  year state  number_of_fires
0  1/1/1998  Janeiro  1998  Acre              0.0
1  1/1/1999  Janeiro  1999  Acre              0.0
2  1/1/2000  Janeiro  2000  Acre              0.0
3  1/1/2001  Janeiro  2001  Acre              0.0
4  1/1/2002  Janeiro  2002  Acre              0.0

In [91]:
df = df.reset_index()

In [92]:
df.head()

   index      date    month  year state  number_of_fires
0      0  1/1/1998  Janeiro  1998  Acre              0.0
1      1  1/1/1999  Janeiro  1999  Acre              0.0
2      2  1/1/2000  Janeiro  2000  Acre              0.0
3      3  1/1/2001  Janeiro  2001  Acre              0.0
4      4  1/1/2002  Janeiro  2002  Acre              0.0

In [93]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6322 entries, 0 to 6321
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   index            6322 non-null   int64
 1   date             6322 non-null   object
 2   month            6322 non-null   object
 3   year             6322 non-null   int64
 4   state            6322 non-null   object
 5   number_of_fires  6322 non-null   float64
dtypes: float64(1), int64(2), object(3)
memory usage: 296.5+ KB

In [95]:
df.isnull().sum()

index              0
date               0
month              0
year               0
state              0
number_of_fires    0
dtype: int64

In [97]:
df["number_of_fires"].isnull()

0       False
1       False
2       False
3       False
4       False
        ...
6317    False
6318    False
6319    False
6320    False
6321    False
Name: number_of_fires, Length: 6322, dtype: bool